/* Оружие и урон */

enum E_WEAPONS
{
    E_WEAPON_ID,
    E_WEAPON_NAME[65],
    E_WEAPON_TYPE,
    E_WEAPON_CD, // Минимальная задержка между выстрелами в мс
    Float:E_WEAPON_DIST, // Максимальная дистанция выстрела
    E_WEAPON_CLIP, // Размер одной обоймы
    E_WEAPON_SLOT
}
enum
{
    WEAPON_TYPE_NONE, // Неопределён
    WEAPON_TYPE_FIST, // Кулак
    WEAPON_TYPE_MELEE, // Оружие ближнего боя
    WEAPON_TYPE_GUN, // Огнестрел
    WEAPON_TYPE_DAMAGE, // Вид урона
    WEAPON_TYPE_GRENADE, // Метательное
    WEAPON_TYPE_WHIP, // Удар оружием в близи
    WEAPON_TYPE_ROCKET, // Ракетное оружие
    WEAPON_TYPE_SPRAY, // Спреевые, огнетушитель, баллончик, огнемёт
    WEAPON_TYPE_PHOTO, // Фотоаппарат
    WEAPON_TYPE_GOOGLES // Очки
}
new Weapons[][E_WEAPONS] =
{
    {0, "Кулак", WEAPON_TYPE_FIST, 250, 2.5, 0, 0},
	{1, "Кастет", WEAPON_TYPE_MELEE, 250, 2.5, 0, 0},
	{2, "Клюшка для гольфа", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{3, "Дубинка", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{4, "Нож", WEAPON_TYPE_MELEE, 250, 3.5, 0, 1},
	{5, "Бита", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{6, "Лопата", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{7, "Бильярдный кий", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{8, "Катана", WEAPON_TYPE_MELEE, 250, 4.0, 0, 1},
	{9, "Бензопила", WEAPON_TYPE_MELEE, 30, 4.0, 0, 1},
	{10, "Двухстороннее дилдо", WEAPON_TYPE_MELEE, 250, 2.5, 0, 10},
	{11, "Дилдо", WEAPON_TYPE_MELEE, 250, 2.5, 0, 10},
	{12, "Вибратор", WEAPON_TYPE_MELEE, 250, 2.5, 0, 10},
	{13, "Вибратор", WEAPON_TYPE_MELEE, 250, 2.5, 0, 10},
	{14, "Цветы", WEAPON_TYPE_MELEE, 250, 4.0, 0, 10},
	{15, "Трость", WEAPON_TYPE_MELEE, 250, 4.0, 0, 10},
	{16, "Граната", WEAPON_TYPE_GRENADE, 0, 0.0, 0, 8},
	{17, "Дымовая граната", WEAPON_TYPE_GRENADE, 0, 0.0, 0, 8},
	{18, "Коктейль Молотова", WEAPON_TYPE_GRENADE, 0, 0.0, 0, 8},
	{19, "", WEAPON_TYPE_NONE, 90, 0.0, 0, -1},
	{20, "", WEAPON_TYPE_NONE, 20, 0.0, 0, -1},
	{21, "", WEAPON_TYPE_NONE, 0, 0.0, 0, -1},
	{22, "Кольт-45", WEAPON_TYPE_GUN, 300, 100.0, 17, 2},
	{23, "Кольт-45 с глушителем", WEAPON_TYPE_GUN, 300, 100.0, 17, 2},
	{24, "Пустынный орёл", WEAPON_TYPE_GUN, 500, 100.0, 14, 2},
	{25, "Помповый дробовик", WEAPON_TYPE_GUN, 1000, 100.0, 20, 3},
	{26, "Обрез", WEAPON_TYPE_GUN, 275, 100.0, 20, 3},
	{27, "SPAS-12", WEAPON_TYPE_GUN, 350, 100.0, 20, 3},
	{28, "Микро-Узи", WEAPON_TYPE_GUN, 100, 150.0, 50, 4},
	{29, "MP5", WEAPON_TYPE_GUN, 90, 150.0, 30, 4},
	{30, "AK-47", WEAPON_TYPE_GUN, 110, 170.0, 30, 5},
	{31, "M4", WEAPON_TYPE_GUN, 110, 170.0, 50, 5},
	{32, "Tec-9", WEAPON_TYPE_GUN, 120, 150.0, 50, 4},
	{33, "Винтовка", WEAPON_TYPE_GUN, 800, 150.0, 20, 6},
	{34, "Снайперская винтовка", WEAPON_TYPE_GUN, 650, 250.0, 20, 6},
	{35, "Гранатомёт", WEAPON_TYPE_ROCKET, 0, 0.0, 0, 7},
	{36, "Самонаводящийся гранатомёт", WEAPON_TYPE_ROCKET, 0, 0.0, 0, 7},
	{37, "Огнемёт", WEAPON_TYPE_SPRAY, 0, 0.0, 0, 7},
	{38, "Миниган", WEAPON_TYPE_GUN, 0, 0.0, 0, 7},
	{39, "Пакет взрывчатки", WEAPON_TYPE_NONE, 0, 0.0, 0, 8},
	{40, "Детонатор", WEAPON_TYPE_NONE, 0, 0.0, 0, 12},
	{41, "Баллончик с краской", WEAPON_TYPE_SPRAY, 1500, 4.0, 0, 9},
	{42, "Огнетушитель", WEAPON_TYPE_SPRAY, 1000, 4.0, 0, 9},
	{43, "Фотоаппарат", WEAPON_TYPE_PHOTO, 0, 0.0, 0, 9},
	{44, "Очки ночного видения", WEAPON_TYPE_GOOGLES, 0, 0.0, 0, 11},
	{45, "Тепловизор", WEAPON_TYPE_GOOGLES, 0, 0.0, 0, 11},
	{46, "Парашют", WEAPON_TYPE_FIST, 0, 0.0, 0, 11},
	{47, "", WEAPON_TYPE_NONE, 0, 0.0, 0, -1},
	{48, "", WEAPON_TYPE_NONE, 0, 0.0, 0, -1},
	{49, "Автомобиль", WEAPON_TYPE_DAMAGE, 0, 0.0, 0, -1},
	{50, "Вертолетные лопасти", WEAPON_TYPE_DAMAGE, 0, 0.0, 0, -1},
	{51, "Взрыв", WEAPON_TYPE_DAMAGE, 0, 0.0, 0, -1},
	{52, "", WEAPON_TYPE_NONE, 0, 0.0, 0, -1},
	{53, "Утопление", WEAPON_TYPE_DAMAGE, 0, 0.0, 0, -1},
	{54, "Падение", WEAPON_TYPE_DAMAGE, 0, 0.0, 0, -1},
	{55, "Удар оружием", WEAPON_TYPE_WHIP, 450, 2.5, 0, -1}
};

new Float:WeaponDamages[][] =
{
	/*0*/{0.0, 0.0, 0.0, 6.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*1*/{0.0, 0.0, 0.0, 9.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*2*/{0.0, 0.0, 0.0, 9.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*3*/{0.0, 0.0, 0.0, 17.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*4*/{0.0, 0.0, 0.0, 15.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*5*/{0.0, 0.0, 0.0, 15.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*6*/{0.0, 0.0, 0.0, 15.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*7*/{0.0, 0.0, 0.0, 15.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*8*/{0.0, 0.0, 0.0, 20.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*9*/{0.0, 0.0, 0.0, 6.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*10*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*11*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*12*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*13*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*14*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*15*/{0.0, 0.0, 0.0, 7.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*16*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*17*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*18*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*19*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*20*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*21*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*22*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*23*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*24*/{0.0, 0.0, 0.0, 60.0, 60.0, 40.0, 40.0, 40.0, 40.0, 90.0},
	/*25 x15*/{0.0, 0.0, 0.0, 6.0, 6.0, 5.0, 5.0, 5.0, 5.0, 10.0},
	/*26 x15*/{0.0, 0.0, 0.0, 6.0, 6.0, 5.0, 5.0, 5.0, 5.0, 10.0},
	/*27 x8*/{0.0, 0.0, 0.0, 12.0, 12.0, 10.0, 10.0, 10.0, 10.0, 18.0},
	/*28*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*29*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*30*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*31*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*32*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*33*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*34*/{0.0, 0.0, 0.0, 50.0, 50.0, 35.0, 35.0, 35.0, 35.0, 90.0},
	/*35*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*36*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*37*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*38*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*39*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*40*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*41*/{0.0, 0.0, 0.0, 5.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*42*/{0.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*43*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*44*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*45*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*46*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*47*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*48*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*49*/{1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0},
	/*50*/{1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0},
	/*51 множитель*/{1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0},
	/*52*/{0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0}, 
	/*53*/{1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0},
	/*54*/{160.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0},
	/*55*/{0.0, 0.0, 0.0, 8.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0}
};

#define IsMeleeWeapon(%0) (Weapons[%0][E_WEAPON_TYPE] == WEAPON_TYPE_MELEE)
#define IsSprayWeapon(%0) (Weapons[%0][E_WEAPON_TYPE] == WEAPON_TYPE_SPRAY)
#define IsShootWeapon(%0) (Weapons[%0][E_WEAPON_TYPE] == WEAPON_TYPE_GUN)

new Float:FallDeathVelo[MAX_PLAYERS];